[{"id":"blog_1","date":"Apr 8, 2015","content":[{"content":"I remember sitting down with friends from different NGOs who were working on education programs in villages across Palestine while they told hilarious, yet truly horrifying stories about the ignorance they encountered during their work. Some women they were encountering were having child after child with no notion of how children were conceived except that it involved intercourse, but the details were a mystery. The existence of different contraceptives came as a shock to many and even after extensive counseling on how to use said contraceptives, these women were becoming pregnant because of this same ignorance."},{"content":"At first I was amused, but then I got to really thinking how sad it was. These women were miserable because they kept having children they couldn’t afford, yet they didn’t know any other way. They had no access to education, and they had nobody to talk to because the subject involved sex, and everybody knows that in the Middle East and North Africa, sex is a taboo subject."},{"content":"That’s when the idea for Karaz took root. I wanted to create a site for engaged or married men and women to turn to whenever they had any questions regarding relationships, including sexual relationships, from the safety and anonymity of their own homes. I wanted a person to be able to go to this one site and find everything they needed to know about sex from a medical and psychological standpoint, without any profanity, nudity, or sexualization, just facts."}],"youtube_url":"https://www.youtube.com/watch?v=Wult5UT7i2M&t=32s","subtitle":[{"title":"I knew from the start that I would encounter resistance and criticism, but I also knew that there was a legitimate need for something like this and was prepared to brave the storm.","content":[{"content":"Sex is a three-letter word that some view as a natural part of life. Others see it as a manifestation of the love a husband and wife have for one another. While others view it as something to be ashamed of. But the reality is that sex is an important component of marriage. Islamic law gives either partner the right to divorce in the absence of sexual satisfaction. There are countless Hadiths (Sayings of the Prophet Muhammad) that discuss the importance of sexual relations to a marriage. In terms of religion, there was nothing preventing me from addressing these issues in a respectful manner. When I began looking into relationships in general and how they were faring, I was pretty shocked. We have this view that divorce exists only in the US and Europe, but the more I dug, the more I uncovered."}]},{"title":"Divorce rates in the MENA region are sky high and continue to grow. A lot of women who ask for divorce during their first year cite sexual incompatibility as a reason.","content":[{"content":"Now, more than ever I believe in the importance of Karaz. Every day we receive messages from people with questions that they want answers to. People that NEED answers to questions that they are too ashamed to ask. Our company is continuing to grow and is regularly visited by people in 48 countries around the world. Even our critics have become reluctant fans because they found nothing to criticize and sometimes found themselves in need of our support and advice."},{"content":"We needed to have a forum where the sexual relationship between couples is treated as a necessary part of a healthy marriage and that addresses all aspects of this relationship without shame. And now there is one: Karaz. In order for anything in life to work, you have to put in time and effort. This includes all aspects of marriage: communication, partnership and physical intimacy. At Karaz, you can find articles that address all sorts of issues regarding the marriage bed and relationships in general. There’s a message board where you can post questions and get answers by other members, as well as Karaz’s doctors or psychologists, depending on which is appropriate."},{"content":"Although this is just the beginning of our journey, we will continue to grow, to add more articles and information and help more people overcome whatever issues they’re struggling with in their personal lives. We also hope to shift the view of what sex is and what it isn’t. It isn’t something dirty, but it is as Allah meant it to be: a beautiful way to forge a bond between husband and wife."}]}],"subscribe":["test@test.com","star@star.com","star@sta.com",null,"d@d.com","test@active.com"],"comments":[{"date":"Apr 13,2020,6:49","comment":"hello","name":"ivan","commentemail":"ivan@email.com"},{"date":"Apr 13,2020,6:49","comment":"hello","name":"star@ivan","commentemail":"ivan@email.com"},{"date":"Apr 13,2020,6:49","comment":"hello","name":"ivan","commentemail":"ivan@email.com"},{"date":"Apr 13,2020,6:49","comment":"hello","name":"star@ivan","commentemail":"ivan@email.com"},{"date":"Apr 13,2020,7:13","comment":"hello","name":"ivan","commentemail":"ivan@email.com"},{"date":"Apr 13,2020,7:13","comment":"hello","name":"ivan","commentemail":"ivan@email.com"},{"date":"Apr 13,2020,7:18","comment":"hello","name":"ivan@ivan","commentemail":"ivan@email.com"},{"date":"Apr 13,2020,7:19","comment":"hello","name":"ivan","commentemail":"ivan@email.com"},{"date":"Apr 13,2020,7:19","comment":"hello","name":"ivan","commentemail":"ivan@email.com"},{"date":"Apr 13,2020,8:0","comment":"hello","name":"user","commentemail":"test@test.com"},{"date":"Apr 13,2020,8:0","comment":"hello","name":"user","commentemail":"test@test.com"},{"date":"Apr 13,2020,8:0","comment":"afd","name":"dsf","commentemail":"ivan@email.com"},{"date":"Apr 13,2020,8:23","comment":"start","name":"ivan","commentemail":"d@d.com"},{"date":"Apr 13,2020,8:23","comment":"ddd","name":"ivan@ivan","commentemail":"d@d.com"},{"date":"Apr 13,2020,8:23","comment":"ddd","name":"ivan","commentemail":"d@d.com"},{"date":"Apr 13,2020,8:24","comment":"ddd","name":"ivan","commentemail":"d@d.com"},{"date":"Apr 13,2020,8:26","comment":"11","name":"n","commentemail":"a@a.com"},{"date":"Apr 13,2020,8:27","comment":"111","name":"1","commentemail":"1@1.com"},{"date":"Apr 13,2020,9:13","comment":"Hello","name":"nataliya","commentemail":"test@test.com"},{"date":"Apr 13,2020,9:14","comment":"hello, Nataliya","name":"ivan@nataliya","commentemail":"test@active.com"},{"date":"Apr 13,2020,9:20","comment":"sfa","name":"afa@ivan@nataliya","commentemail":"adfasf@fdsf.com"},{"date":"Jan 7,2022,20:52","comment":"sfsdf","name":"asfdsa","commentemail":"dsafasdf@afjkdlsajf.com"}]}]